# Taps
tap "git-friendly/git-friendly"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"

# CLI tools
brew "aws-cdk" # AWS Cloud Development Kit
brew "awscli" # Official Amazon AWS command-line interface
brew "bat" # Output highlighting (better `cat`)
brew "eza" # Listing files with info (better `ls`)
brew "fastfetch" # Show pretty system info
brew "fd" # Find entries in your filesystem (better `find`)
brew "fnm" # Node.js version manager
brew "fzf" # Fuzzy file finder and filtering
brew "gh" # GitHub CLI: interact with GitHub PRs, issues, repos
brew "git" # Version control
brew "git-delta" # Diff pager for `git` and `grep` output (better `diff`)
brew "gnupg" # Encryption and signing capabilities for data verification
brew "htop" # Performance and resource monitoring tool (better `top`)
brew "mpv" # Media player
brew "node" # Fallback Node.js version
brew "pinentry-mac" # Securely enter your GPG passphrase
brew "pnpm" # Efficient Node.js package manager
brew "prettyping" # Prettier and compact `ping`
brew "python@3.11" # Required by awscli
brew "ripgrep" # Searching within files (better `grep`)
brew "sops" # Secrets manager
brew "starship" # Prompt manager
brew "tlrc" # Community-maintained docs (better `man`)
brew "trash-cli", link: true # Record and restore removed files (better `rm`)
brew "webp" # More efficient web images
brew "zoxide" # Convenient and magical navigation (better `cd`)
brew "zsh" # A shell of choice
brew "zsh-autosuggestions" # Fish-like autosuggestions for Zsh
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for Zsh
brew "git-friendly/git-friendly/git-friendly" # Improved Git commands for common tasks
brew "jesseduffield/lazydocker/lazydocker" # Full Docker management app
brew "jesseduffield/lazygit/lazygit" # Full Git management app
brew "oven-sh/bun/bun" # Bun runtime

# Temporarily required for some work projects
brew "cairo"
brew "giflib"
brew "jpeg"
brew "libpng"
brew "librsvg"
brew "pango"
brew "pkgconf"

# Fonts
cask "font-symbols-only-nerd-font"

# GUI apps
cask "1password" # Password manager
cask "adobe-creative-cloud" # Adobe Photoshop & Lightroom
cask "bruno" # Local-first API client
brew "claude" # Claude for Desktop
cask "cleanshot" # Annotated screenshots & quick videos
cask "coteditor" # Simple code/text editor
cask "cursor" # AI Code editor
cask "dash" # API documentation reader
cask "firefox@developer-edition" # Browser with configurable privacy
cask "ghostty" # Better terminal emulator
cask "github" # GitHub Desktop GUI
cask "itsycal" # Tiny popup calendar in a menu bar
cask "jordanbaird-ice" # Manage menu bar icons
cask "keka" # File archiver and extractor
cask "ledger-live" # Crypto hardware wallet manager
cask "legcord" # Messaging / Community
cask "marta" # File manager
cask "mimestream" # Email client
cask "notion" # Note-taking app
cask "optimage" # Image optimization
cask "orbstack" # Running containerized applications. Ships `docker-compose` as well
cask "pearcleaner" # Clean up macOS from junk and apps leftovers
cask "qobuz" # Hi-rez audio streaming platform
cask "raycast" # All-in-one app / tasks launcher
cask "rectangle" # Window manager
cask "rocket" # Handy emojis picker
cask "slack" # Messaging social platform
cask "superduper" # Data backup
cask "syntax-highlight", args: { no_quarantine: true } # Preview many different source code files
cask "tableplus" # Database management system
cask "telegram" # Messenger
cask "visual-studio-code" # Code editor
cask "whatsapp" # Messenger

# VS Code extensions
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dejmedus.tailwind-sorter"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot" # Auto-installed when Copilot chat is used
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "kilocode.kilo-code"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-containers" # Auto-installed by Docker extension
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.node-debug2"
vscode "naumovs.color-highlight"
vscode "orta.vscode-twoslash-queries"
vscode "redhat.vscode-yaml"
vscode "sapegin.emoji-console-log"
vscode "sapegin.just-blame"
vscode "sapegin.mini-markdown"
vscode "sapegin.theme-squirrelsonglight"
vscode "sapegin.todo-tomorrow"
vscode "sleistner.vscode-fileutils"
vscode "sonarsource.sonarlint-vscode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "tekumara.typos-vscode"
vscode "usernamehw.errorlens"
