# Taps
tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"

# CLI tools
brew "python@3.11" # required by awscli
brew "awscli"
brew "bat" # `cat` alternative
brew "eza" # `ls` alternative
brew "fastfetch" # neofetch replacement
brew "fd" # `find` alternative
brew "fnm"
brew "fzf" # fuzzy finder
brew "gh"
brew "git"
brew "git-delta" # diff pager for `git` and `grep` output
brew "htop" # `top` alternative
brew "neovim"
brew "node" # fallback Node.js version
brew "pnpm"
brew "prettyping"
brew "ripgrep"
brew "starship"
brew "tldr" # `man` alternative
brew "trash-cli" # safer `rm` alternative
brew "tree"
brew "webp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "git-friendly/git-friendly/git-friendly"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"

# Temporarily required for work projects
brew "libpng"
brew "cairo"
brew "giflib"
brew "jpeg"
brew "pango"
brew "librsvg"
brew "pkg-config"

# GUI apps
cask "1password@7"
cask "arc"
cask "bartender"
cask "cleanmymac"
cask "cleanshot"
cask "coteditor"
cask "discord"
cask "docker"
cask "hazeover"
cask "insomnia"
cask "itsycal"
cask "keka"
cask "ledger-live"
cask "marta"
cask "nordvpn"
cask "notion"
cask "optimage"
cask "qobuz"
cask "raycast"
cask "rectangle"
cask "rocket"
cask "slack"
cask "spotify"
cask "superduper"
cask "syntax-highlight"
cask "tableplus"
cask "telegram"
cask "tradingview"
cask "visual-studio-code"
cask "vivaldi"
cask "wezterm"

# Fonts
cask "font-symbols-only-nerd-font"

# VSCode extensions
vscode "amodio.toggle-excluded-files"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lukegeneva.auto-collapse-explorer"
vscode "maxvanderschee.web-accessibility"
vscode "mdickin.markdown-shortcuts"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode.node-debug2"
vscode "naumovs.color-highlight"
vscode "orta.vscode-twoslash-queries"
vscode "patbenatar.advanced-new-file"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "sapegin.emoji-console-log"
vscode "sapegin.theme-squirrelsonglight"
vscode "sapegin.todo-tomorrow"
vscode "sburg.vscode-javascript-booster"
vscode "sleistner.vscode-fileutils"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.cody-ai"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "wix.glean"
vscode "yoavbls.pretty-ts-errors"
vscode "ypresto.vscode-intelli-refactor"
