# Taps
tap "git-friendly/git-friendly"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"

# CLI tools
brew "python@3.11" # Required by awscli
brew "awscli" # Official Amazon AWS command-line interface
brew "bat" # Output highlighting (better `cat`)
brew "eza" # Listing files with info (better `ls`)
brew "fastfetch" # Show pretty system info
brew "fd" # Find entries in your filesystem (better `find`)
brew "fnm" # Node.js version manager
brew "fzf" # Fuzzy file finder and filtering
brew "gh" # GitHub CLI: interact with GitHub PRs, issues, repos
brew "git" # Version control
brew "git-delta" # Diff pager for `git` and `grep` output (better `diff`)
brew "htop" # Performance and resource monitoring tool (better `top`)
brew "neovim" # Text editor for terminal
brew "node" # Fallback Node.js version
brew "pnpm" # Efficient Node.js package manager
brew "prettyping" # Prettier and compact `ping`
brew "ripgrep" # Searching within files (better `grep`)
brew "starship" # Prompt manager
brew "tlrc" # Community-maintained docs (better `man`)
brew "trash-cli" # Record and restore removed files (better `rm`)
brew "webp" # More efficient web images
brew "zoxide" # Convenient and majical navigation (better `cd`)
brew "zsh" # A shell of choice
brew "zsh-autosuggestions" # Fish-like autosuggestions for Zsh
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for Zsh
brew "git-friendly/git-friendly/git-friendly" # Improved Git commands for common tasks
brew "jesseduffield/lazydocker/lazydocker" # Full Docker management app
brew "jesseduffield/lazygit/lazygit" # Full Git management app

# Temporarily required for some work projects
brew "libpng"
brew "cairo"
brew "giflib"
brew "jpeg"
brew "pango"
brew "librsvg"
brew "pkg-config"

# GUI apps
cask "1password@7" # Password manager
cask "arc" # Modern browser
cask "bartender" # Manage menu bar icons
cask "bruno" # API client
cask "cleanmymac" # System clean up manager
cask "cleanshot" # Better screenshot utility
cask "coteditor" # Simple code/text editor
cask "discord" # Messaging social platform
cask "docker" # Running containerized applications
cask "hazeover" # Fades out inactive windows
cask "insomnia" # API client
cask "itsycal" # Tiny popup calendar in a menu bar
cask "keka" # File archiver and extractor
cask "ledger-live" # Crypto hardware wallet manager
cask "marta" # File manager
cask "nordvpn" # VPN client
cask "notion" # Note-taking app
cask "optimage" # Image optimization
cask "qobuz" # Hi-rez audio streaming platform
cask "raycast" # All-in-one app / tasks launcher
cask "rectangle" # Window manager
cask "rocket" # Handy emojis picker
cask "slack" # Messaging social platform
cask "spotify" # Audio streaming platform
cask "superduper" # Data backup
cask "syntax-highlight", args: { no_quarantine: true } # Preview many different source code files
cask "tableplus" # Database managmenent system
cask "telegram" # Messenger
cask "visual-studio-code" # Code editor
cask "vivaldi" # Browser with built-in privacy
cask "wezterm" # Better terminal emulator

# Fonts
cask "font-symbols-only-nerd-font"

# VSCode extensions
vscode "amodio.toggle-excluded-files"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "maxvanderschee.web-accessibility"
vscode "mdickin.markdown-shortcuts"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode.node-debug2"
vscode "naumovs.color-highlight"
vscode "orta.vscode-twoslash-queries"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "robole.file-bunny"
vscode "sapegin.emoji-console-log"
vscode "sapegin.theme-squirrelsonglight"
vscode "sapegin.todo-tomorrow"
vscode "sburg.vscode-javascript-booster"
vscode "sleistner.vscode-fileutils"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.cody-ai"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "tekumara.typos-vscode"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "usernamehw.errorlens"
vscode "yoavbls.pretty-ts-errors"
vscode "ypresto.vscode-intelli-refactor"
